__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 240, 5)       0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 240, 5)       0                                            
__________________________________________________________________________________________________
input_3 (InputLayer)            (None, 60, 5)        0                                            
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 120, 64)      2304        input_1[0][0]                    
__________________________________________________________________________________________________
conv1d_21 (Conv1D)              (None, 120, 64)      2304        input_2[0][0]                    
__________________________________________________________________________________________________
conv1d_41 (Conv1D)              (None, 30, 64)       2304        input_3[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 120, 64)      256         conv1d_1[0][0]                   
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 120, 64)      256         conv1d_21[0][0]                  
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, 30, 64)       256         conv1d_41[0][0]                  
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 120, 64)      0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 120, 64)      0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
activation_35 (Activation)      (None, 30, 64)       0           batch_normalization_35[0][0]     
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 60, 64)       0           activation_1[0][0]               
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 60, 64)       0           activation_18[0][0]              
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 15, 64)       0           activation_35[0][0]              
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 60, 64)       12352       max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
conv1d_22 (Conv1D)              (None, 60, 64)       12352       max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
conv1d_42 (Conv1D)              (None, 15, 64)       12352       max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 60, 64)       256         conv1d_2[0][0]                   
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 60, 64)       256         conv1d_22[0][0]                  
__________________________________________________________________________________________________
batch_normalization_36 (BatchNo (None, 15, 64)       256         conv1d_42[0][0]                  
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 60, 64)       0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 60, 64)       0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
activation_36 (Activation)      (None, 15, 64)       0           batch_normalization_36[0][0]     
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 60, 64)       12352       activation_2[0][0]               
__________________________________________________________________________________________________
conv1d_23 (Conv1D)              (None, 60, 64)       12352       activation_19[0][0]              
__________________________________________________________________________________________________
conv1d_43 (Conv1D)              (None, 15, 64)       12352       activation_36[0][0]              
__________________________________________________________________________________________________
add_1 (Add)                     (None, 60, 64)       0           max_pooling1d_1[0][0]            
                                                                 conv1d_3[0][0]                   
__________________________________________________________________________________________________
add_9 (Add)                     (None, 60, 64)       0           max_pooling1d_2[0][0]            
                                                                 conv1d_23[0][0]                  
__________________________________________________________________________________________________
add_17 (Add)                    (None, 15, 64)       0           max_pooling1d_3[0][0]            
                                                                 conv1d_43[0][0]                  
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 60, 64)       256         add_1[0][0]                      
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 60, 64)       256         add_9[0][0]                      
__________________________________________________________________________________________________
batch_normalization_37 (BatchNo (None, 15, 64)       256         add_17[0][0]                     
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 60, 64)       0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 60, 64)       0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
activation_37 (Activation)      (None, 15, 64)       0           batch_normalization_37[0][0]     
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 60, 64)       12352       activation_3[0][0]               
__________________________________________________________________________________________________
conv1d_24 (Conv1D)              (None, 60, 64)       12352       activation_20[0][0]              
__________________________________________________________________________________________________
conv1d_44 (Conv1D)              (None, 15, 64)       12352       activation_37[0][0]              
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 60, 64)       256         conv1d_4[0][0]                   
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 60, 64)       256         conv1d_24[0][0]                  
__________________________________________________________________________________________________
batch_normalization_38 (BatchNo (None, 15, 64)       256         conv1d_44[0][0]                  
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 60, 64)       0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 60, 64)       0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
activation_38 (Activation)      (None, 15, 64)       0           batch_normalization_38[0][0]     
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 60, 64)       12352       activation_4[0][0]               
__________________________________________________________________________________________________
conv1d_25 (Conv1D)              (None, 60, 64)       12352       activation_21[0][0]              
__________________________________________________________________________________________________
conv1d_45 (Conv1D)              (None, 15, 64)       12352       activation_38[0][0]              
__________________________________________________________________________________________________
add_2 (Add)                     (None, 60, 64)       0           add_1[0][0]                      
                                                                 conv1d_5[0][0]                   
__________________________________________________________________________________________________
add_10 (Add)                    (None, 60, 64)       0           add_9[0][0]                      
                                                                 conv1d_25[0][0]                  
__________________________________________________________________________________________________
add_18 (Add)                    (None, 15, 64)       0           add_17[0][0]                     
                                                                 conv1d_45[0][0]                  
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 60, 64)       256         add_2[0][0]                      
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 60, 64)       256         add_10[0][0]                     
__________________________________________________________________________________________________
batch_normalization_39 (BatchNo (None, 15, 64)       256         add_18[0][0]                     
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 60, 64)       0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 60, 64)       0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
activation_39 (Activation)      (None, 15, 64)       0           batch_normalization_39[0][0]     
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, 30, 128)      24704       activation_5[0][0]               
__________________________________________________________________________________________________
conv1d_26 (Conv1D)              (None, 30, 128)      24704       activation_22[0][0]              
__________________________________________________________________________________________________
conv1d_46 (Conv1D)              (None, 8, 128)       24704       activation_39[0][0]              
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 30, 128)      512         conv1d_6[0][0]                   
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 30, 128)      512         conv1d_26[0][0]                  
__________________________________________________________________________________________________
batch_normalization_40 (BatchNo (None, 8, 128)       512         conv1d_46[0][0]                  
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 30, 128)      0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 30, 128)      0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
activation_40 (Activation)      (None, 8, 128)       0           batch_normalization_40[0][0]     
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, 30, 128)      8320        add_2[0][0]                      
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, 30, 128)      49280       activation_6[0][0]               
__________________________________________________________________________________________________
conv1d_28 (Conv1D)              (None, 30, 128)      8320        add_10[0][0]                     
__________________________________________________________________________________________________
conv1d_27 (Conv1D)              (None, 30, 128)      49280       activation_23[0][0]              
__________________________________________________________________________________________________
conv1d_48 (Conv1D)              (None, 8, 128)       8320        add_18[0][0]                     
__________________________________________________________________________________________________
conv1d_47 (Conv1D)              (None, 8, 128)       49280       activation_40[0][0]              
__________________________________________________________________________________________________
add_3 (Add)                     (None, 30, 128)      0           conv1d_8[0][0]                   
                                                                 conv1d_7[0][0]                   
__________________________________________________________________________________________________
add_11 (Add)                    (None, 30, 128)      0           conv1d_28[0][0]                  
                                                                 conv1d_27[0][0]                  
__________________________________________________________________________________________________
add_19 (Add)                    (None, 8, 128)       0           conv1d_48[0][0]                  
                                                                 conv1d_47[0][0]                  
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 30, 128)      512         add_3[0][0]                      
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 30, 128)      512         add_11[0][0]                     
__________________________________________________________________________________________________
batch_normalization_41 (BatchNo (None, 8, 128)       512         add_19[0][0]                     
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 30, 128)      0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 30, 128)      0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
activation_41 (Activation)      (None, 8, 128)       0           batch_normalization_41[0][0]     
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, 30, 128)      49280       activation_7[0][0]               
__________________________________________________________________________________________________
conv1d_29 (Conv1D)              (None, 30, 128)      49280       activation_24[0][0]              
__________________________________________________________________________________________________
conv1d_49 (Conv1D)              (None, 8, 128)       49280       activation_41[0][0]              
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 30, 128)      512         conv1d_9[0][0]                   
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 30, 128)      512         conv1d_29[0][0]                  
__________________________________________________________________________________________________
batch_normalization_42 (BatchNo (None, 8, 128)       512         conv1d_49[0][0]                  
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 30, 128)      0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 30, 128)      0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
activation_42 (Activation)      (None, 8, 128)       0           batch_normalization_42[0][0]     
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, 30, 128)      49280       activation_8[0][0]               
__________________________________________________________________________________________________
conv1d_30 (Conv1D)              (None, 30, 128)      49280       activation_25[0][0]              
__________________________________________________________________________________________________
conv1d_50 (Conv1D)              (None, 8, 128)       49280       activation_42[0][0]              
__________________________________________________________________________________________________
add_4 (Add)                     (None, 30, 128)      0           add_3[0][0]                      
                                                                 conv1d_10[0][0]                  
__________________________________________________________________________________________________
add_12 (Add)                    (None, 30, 128)      0           add_11[0][0]                     
                                                                 conv1d_30[0][0]                  
__________________________________________________________________________________________________
add_20 (Add)                    (None, 8, 128)       0           add_19[0][0]                     
                                                                 conv1d_50[0][0]                  
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 30, 128)      512         add_4[0][0]                      
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 30, 128)      512         add_12[0][0]                     
__________________________________________________________________________________________________
batch_normalization_43 (BatchNo (None, 8, 128)       512         add_20[0][0]                     
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 30, 128)      0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 30, 128)      0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
activation_43 (Activation)      (None, 8, 128)       0           batch_normalization_43[0][0]     
__________________________________________________________________________________________________
conv1d_11 (Conv1D)              (None, 15, 256)      98560       activation_9[0][0]               
__________________________________________________________________________________________________
conv1d_31 (Conv1D)              (None, 15, 256)      98560       activation_26[0][0]              
__________________________________________________________________________________________________
conv1d_51 (Conv1D)              (None, 4, 256)       98560       activation_43[0][0]              
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 15, 256)      1024        conv1d_11[0][0]                  
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 15, 256)      1024        conv1d_31[0][0]                  
__________________________________________________________________________________________________
batch_normalization_44 (BatchNo (None, 4, 256)       1024        conv1d_51[0][0]                  
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 15, 256)      0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 15, 256)      0           batch_normalization_27[0][0]     
__________________________________________________________________________________________________
activation_44 (Activation)      (None, 4, 256)       0           batch_normalization_44[0][0]     
__________________________________________________________________________________________________
conv1d_13 (Conv1D)              (None, 15, 256)      33024       add_4[0][0]                      
__________________________________________________________________________________________________
conv1d_12 (Conv1D)              (None, 15, 256)      196864      activation_10[0][0]              
__________________________________________________________________________________________________
conv1d_33 (Conv1D)              (None, 15, 256)      33024       add_12[0][0]                     
__________________________________________________________________________________________________
conv1d_32 (Conv1D)              (None, 15, 256)      196864      activation_27[0][0]              
__________________________________________________________________________________________________
conv1d_53 (Conv1D)              (None, 4, 256)       33024       add_20[0][0]                     
__________________________________________________________________________________________________
conv1d_52 (Conv1D)              (None, 4, 256)       196864      activation_44[0][0]              
__________________________________________________________________________________________________
add_5 (Add)                     (None, 15, 256)      0           conv1d_13[0][0]                  
                                                                 conv1d_12[0][0]                  
__________________________________________________________________________________________________
add_13 (Add)                    (None, 15, 256)      0           conv1d_33[0][0]                  
                                                                 conv1d_32[0][0]                  
__________________________________________________________________________________________________
add_21 (Add)                    (None, 4, 256)       0           conv1d_53[0][0]                  
                                                                 conv1d_52[0][0]                  
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 15, 256)      1024        add_5[0][0]                      
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 15, 256)      1024        add_13[0][0]                     
__________________________________________________________________________________________________
batch_normalization_45 (BatchNo (None, 4, 256)       1024        add_21[0][0]                     
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 15, 256)      0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
activation_28 (Activation)      (None, 15, 256)      0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
activation_45 (Activation)      (None, 4, 256)       0           batch_normalization_45[0][0]     
__________________________________________________________________________________________________
conv1d_14 (Conv1D)              (None, 15, 256)      196864      activation_11[0][0]              
__________________________________________________________________________________________________
conv1d_34 (Conv1D)              (None, 15, 256)      196864      activation_28[0][0]              
__________________________________________________________________________________________________
conv1d_54 (Conv1D)              (None, 4, 256)       196864      activation_45[0][0]              
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 15, 256)      1024        conv1d_14[0][0]                  
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 15, 256)      1024        conv1d_34[0][0]                  
__________________________________________________________________________________________________
batch_normalization_46 (BatchNo (None, 4, 256)       1024        conv1d_54[0][0]                  
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 15, 256)      0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
activation_29 (Activation)      (None, 15, 256)      0           batch_normalization_29[0][0]     
__________________________________________________________________________________________________
activation_46 (Activation)      (None, 4, 256)       0           batch_normalization_46[0][0]     
__________________________________________________________________________________________________
conv1d_15 (Conv1D)              (None, 15, 256)      196864      activation_12[0][0]              
__________________________________________________________________________________________________
conv1d_35 (Conv1D)              (None, 15, 256)      196864      activation_29[0][0]              
__________________________________________________________________________________________________
conv1d_55 (Conv1D)              (None, 4, 256)       196864      activation_46[0][0]              
__________________________________________________________________________________________________
add_6 (Add)                     (None, 15, 256)      0           add_5[0][0]                      
                                                                 conv1d_15[0][0]                  
__________________________________________________________________________________________________
add_14 (Add)                    (None, 15, 256)      0           add_13[0][0]                     
                                                                 conv1d_35[0][0]                  
__________________________________________________________________________________________________
add_22 (Add)                    (None, 4, 256)       0           add_21[0][0]                     
                                                                 conv1d_55[0][0]                  
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 15, 256)      1024        add_6[0][0]                      
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 15, 256)      1024        add_14[0][0]                     
__________________________________________________________________________________________________
batch_normalization_47 (BatchNo (None, 4, 256)       1024        add_22[0][0]                     
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 15, 256)      0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
activation_30 (Activation)      (None, 15, 256)      0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
activation_47 (Activation)      (None, 4, 256)       0           batch_normalization_47[0][0]     
__________________________________________________________________________________________________
conv1d_16 (Conv1D)              (None, 8, 512)       393728      activation_13[0][0]              
__________________________________________________________________________________________________
conv1d_36 (Conv1D)              (None, 8, 512)       393728      activation_30[0][0]              
__________________________________________________________________________________________________
conv1d_56 (Conv1D)              (None, 2, 512)       393728      activation_47[0][0]              
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 8, 512)       2048        conv1d_16[0][0]                  
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 8, 512)       2048        conv1d_36[0][0]                  
__________________________________________________________________________________________________
batch_normalization_48 (BatchNo (None, 2, 512)       2048        conv1d_56[0][0]                  
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 8, 512)       0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
activation_31 (Activation)      (None, 8, 512)       0           batch_normalization_31[0][0]     
__________________________________________________________________________________________________
activation_48 (Activation)      (None, 2, 512)       0           batch_normalization_48[0][0]     
__________________________________________________________________________________________________
conv1d_18 (Conv1D)              (None, 8, 512)       131584      add_6[0][0]                      
__________________________________________________________________________________________________
conv1d_17 (Conv1D)              (None, 8, 512)       786944      activation_14[0][0]              
__________________________________________________________________________________________________
conv1d_38 (Conv1D)              (None, 8, 512)       131584      add_14[0][0]                     
__________________________________________________________________________________________________
conv1d_37 (Conv1D)              (None, 8, 512)       786944      activation_31[0][0]              
__________________________________________________________________________________________________
conv1d_58 (Conv1D)              (None, 2, 512)       131584      add_22[0][0]                     
__________________________________________________________________________________________________
conv1d_57 (Conv1D)              (None, 2, 512)       786944      activation_48[0][0]              
__________________________________________________________________________________________________
add_7 (Add)                     (None, 8, 512)       0           conv1d_18[0][0]                  
                                                                 conv1d_17[0][0]                  
__________________________________________________________________________________________________
add_15 (Add)                    (None, 8, 512)       0           conv1d_38[0][0]                  
                                                                 conv1d_37[0][0]                  
__________________________________________________________________________________________________
add_23 (Add)                    (None, 2, 512)       0           conv1d_58[0][0]                  
                                                                 conv1d_57[0][0]                  
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 8, 512)       2048        add_7[0][0]                      
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 8, 512)       2048        add_15[0][0]                     
__________________________________________________________________________________________________
batch_normalization_49 (BatchNo (None, 2, 512)       2048        add_23[0][0]                     
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 8, 512)       0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
activation_32 (Activation)      (None, 8, 512)       0           batch_normalization_32[0][0]     
__________________________________________________________________________________________________
activation_49 (Activation)      (None, 2, 512)       0           batch_normalization_49[0][0]     
__________________________________________________________________________________________________
conv1d_19 (Conv1D)              (None, 8, 512)       786944      activation_15[0][0]              
__________________________________________________________________________________________________
conv1d_39 (Conv1D)              (None, 8, 512)       786944      activation_32[0][0]              
__________________________________________________________________________________________________
conv1d_59 (Conv1D)              (None, 2, 512)       786944      activation_49[0][0]              
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 8, 512)       2048        conv1d_19[0][0]                  
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, 8, 512)       2048        conv1d_39[0][0]                  
__________________________________________________________________________________________________
batch_normalization_50 (BatchNo (None, 2, 512)       2048        conv1d_59[0][0]                  
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 8, 512)       0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
activation_33 (Activation)      (None, 8, 512)       0           batch_normalization_33[0][0]     
__________________________________________________________________________________________________
activation_50 (Activation)      (None, 2, 512)       0           batch_normalization_50[0][0]     
__________________________________________________________________________________________________
conv1d_20 (Conv1D)              (None, 8, 512)       786944      activation_16[0][0]              
__________________________________________________________________________________________________
conv1d_40 (Conv1D)              (None, 8, 512)       786944      activation_33[0][0]              
__________________________________________________________________________________________________
conv1d_60 (Conv1D)              (None, 2, 512)       786944      activation_50[0][0]              
__________________________________________________________________________________________________
add_8 (Add)                     (None, 8, 512)       0           add_7[0][0]                      
                                                                 conv1d_20[0][0]                  
__________________________________________________________________________________________________
add_16 (Add)                    (None, 8, 512)       0           add_15[0][0]                     
                                                                 conv1d_40[0][0]                  
__________________________________________________________________________________________________
add_24 (Add)                    (None, 2, 512)       0           add_23[0][0]                     
                                                                 conv1d_60[0][0]                  
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 8, 512)       2048        add_8[0][0]                      
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 8, 512)       2048        add_16[0][0]                     
__________________________________________________________________________________________________
batch_normalization_51 (BatchNo (None, 2, 512)       2048        add_24[0][0]                     
__________________________________________________________________________________________________
input_4 (InputLayer)            (None, 439)          0                                            
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 8, 512)       0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
activation_34 (Activation)      (None, 8, 512)       0           batch_normalization_34[0][0]     
__________________________________________________________________________________________________
activation_51 (Activation)      (None, 2, 512)       0           batch_normalization_51[0][0]     
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 50)           22000       input_4[0][0]                    
__________________________________________________________________________________________________
average_pooling1d_1 (AveragePoo (None, 1, 512)       0           activation_17[0][0]              
__________________________________________________________________________________________________
average_pooling1d_2 (AveragePoo (None, 1, 512)       0           activation_34[0][0]              
__________________________________________________________________________________________________
average_pooling1d_3 (AveragePoo (None, 1, 512)       0           activation_51[0][0]              
__________________________________________________________________________________________________
activation_52 (Activation)      (None, 50)           0           dense_1[0][0]                    
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 512)          0           average_pooling1d_1[0][0]        
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 512)          0           average_pooling1d_2[0][0]        
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 512)          0           average_pooling1d_3[0][0]        
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 1536)         78336       activation_52[0][0]              
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 1536)         0           flatten_1[0][0]                  
                                                                 flatten_2[0][0]                  
                                                                 flatten_3[0][0]                  
__________________________________________________________________________________________________
activation_53 (Activation)      (None, 1536)         0           dense_2[0][0]                    
__________________________________________________________________________________________________
add_25 (Add)                    (None, 1536)         0           concatenate_1[0][0]              
                                                                 activation_53[0][0]              
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1)            1537        add_25[0][0]                     
==================================================================================================
Total params: 11,671,409
Trainable params: 11,647,985
Non-trainable params: 23,424
__________________________________________________________________________________________________
